// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  static String m0(goal) => "هدف يومي ${goal} مل";

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "add_to": MessageLookupByLibrary.simpleMessage("أضف إلى"),
        "ar": MessageLookupByLibrary.simpleMessage("العربية"),
        "arch_title": MessageLookupByLibrary.simpleMessage("إنجازات شرب الماء"),
        "coffee": MessageLookupByLibrary.simpleMessage("قهوة"),
        "customization": MessageLookupByLibrary.simpleMessage("تخصيص"),
        "daily_goal_title": m0,
        "day": MessageLookupByLibrary.simpleMessage("يوم"),
        "de": MessageLookupByLibrary.simpleMessage("الألمانية"),
        "drinks": MessageLookupByLibrary.simpleMessage("مشروبات"),
        "en": MessageLookupByLibrary.simpleMessage("الإنجليزية"),
        "es": MessageLookupByLibrary.simpleMessage("الإسبانية"),
        "fr": MessageLookupByLibrary.simpleMessage("الفرنسية"),
        "goal_title": MessageLookupByLibrary.simpleMessage("إعدادات شرب الماء"),
        "hi": MessageLookupByLibrary.simpleMessage("هندي"),
        "history_title": MessageLookupByLibrary.simpleMessage("سجل تاريخي"),
        "ja": MessageLookupByLibrary.simpleMessage("اليابانية"),
        "keep_title": MessageLookupByLibrary.simpleMessage("مواصلة شرب الماء"),
        "language": MessageLookupByLibrary.simpleMessage("اللغة"),
        "medal_title": MessageLookupByLibrary.simpleMessage("ميدالية إنجاز"),
        "milk": MessageLookupByLibrary.simpleMessage("حليب"),
        "month": MessageLookupByLibrary.simpleMessage("شهر"),
        "noti": MessageLookupByLibrary.simpleMessage(
            "الجسم بحاجة إلى طاقة، لا تنسَ أن تشرب الماء!"),
        "privacy": MessageLookupByLibrary.simpleMessage("سياسة الخصوصية"),
        "privacy_desc": MessageLookupByLibrary.simpleMessage(
            "سياسة الخصوصية\nمرحبًا بك في خدمات التطبيق التي يقدمها H2O Keepper (يُشار إليه فيما بعد بـ \"نحن\"). نحن نقدر خصوصيتك وملتزمون بالحفاظ على سلامة معلوماتك الشخصية. تهدف سياسة الخصوصية هذه إلى شرح كيفية جمعنا واستخدامنا وحمايتنا لمعلوماتك الشخصية.\nيرجى قراءة سياسة الخصوصية هذه بعناية قبل استخدام خدماتنا. إذا كنت لا توافق على أي جزء من هذه السياسة، فإننا نوصي بأن تتوقف عن استخدام خدماتنا.\nالمعلومات التي نقوم بجمعها:\nمعلومات التسجيل: عند استخدام تطبيق H2O Keepper، قد يُطلب منك تقديم بعض المعلومات الأساسية، بما في ذلك ولكن لا يقتصر على اسمك، عنوان بريدك الإلكتروني، إلخ.\nمعلومات الاستخدام: قد نجمع معلومات حول استخدامك لخدمات التطبيق، بما في ذلك سجلات شرب الماء الخاصة بك، تفضيلات الاستخدام، إلخ.\nمعلومات الجهاز: قد نجمع تلقائيًا معلومات حول استخدامك للأجهزة وخدمات التطبيق، بما في ذلك نموذج الجهاز، إصدار نظام التشغيل، إصدار التطبيق، إلخ.\nاستخدام المعلومات:\nتقديم الخدمات: نستخدم المعلومات التي نجمعها لتقديم وصيانة وتحسين خدمات تطبيق H2O Keepper لضمان استخدامك السلس.\nتجربة شخصية: قد نستخدم معلوماتك لتخصيص تجربتك مع خدمات التطبيق، بما في ذلك تقديم تنبيهات الماء وتوصيات تتناسب بشكل أفضل مع تفضيلاتك.\nتحليل إحصائي: قد نستخدم معلومات مجمعة ومجهولة لتحليل إحصائي بهدف تحسين خدماتنا وفهم عادات المستخدم.\nمشاركة المعلومات:\nنعد بعدم بيع أو تداول أو نقل معلوماتك الشخصية إلى أطراف ثالثة، إلا بموافقتك الصريحة أو كما يقتضيه القوانين والتشريعات.\nتدابير الخصوصية:\nنتخذ عدة تدابير أمان لحماية معلوماتك الشخصية، بما في ذلك ولكن لا يقتصر على تشفير البيانات، ومراقبة الوصول، إلخ. سنبذل قصارى جهدنا لضمان أمان معلوماتك.\nخصوصية القاصرين:\nخدمة تطبيق H2O Keepper غير مخصصة للأطفال الذين تقل أعمارهم عن 13 عامًا. إذا كنت قاصرًا، فيجب عليك استخدام خدماتنا تحت إشراف والديك أو وصيك.\nتحديثات سياسة الخصوصية:\nنحتفظ بالحق في تعديل أو تحديث سياسة الخصوصية هذه في أي وقت. سنقوم بتحديث سياسة الخصوصية لدينا من خلال إشعار داخل التطبيق أو عن طريق نشرها على موقعنا على الويب.\nإذا كان لديك أي أسئلة أو تعليقات حول سياسة الخصوصية هذه، يرجى الاتصال بنا.\nشكرًا لاختيارك خدمة تطبيق H2O Keepper!"),
        "profile_title": MessageLookupByLibrary.simpleMessage("الإعدادات"),
        "pt": MessageLookupByLibrary.simpleMessage("البرتغالية"),
        "rate": MessageLookupByLibrary.simpleMessage("قيمنا"),
        "record_title":
            MessageLookupByLibrary.simpleMessage("إعدادات شرب الماء"),
        "reminder": MessageLookupByLibrary.simpleMessage("وقت التذكير"),
        "tea": MessageLookupByLibrary.simpleMessage("شاي"),
        "time_select": MessageLookupByLibrary.simpleMessage("اختيار الوقت"),
        "tip": MessageLookupByLibrary.simpleMessage("نصائح"),
        "tip_better": MessageLookupByLibrary.simpleMessage(
            "شرب الماء مرحلياً لتكوين عادة جيدة"),
        "tip_better_descrip": MessageLookupByLibrary.simpleMessage(
            "الماء هو مصدر الحياة وضروري للوظائف الصحيحة للجسم. ومع ذلك، ما إذا كنا نشرب الماء بانتظام وعلمياً مرتبط أيضًا بشكل مباشر بصحة الجسم. شرب الماء مراحل لتشكيل عادات جيدة هو نمط حياة يستحق الثناء.\n\nأولاً، الصباح هو أحد أهم الفترات في اليوم. بعد ليلة كاملة من النوم، يكون جسمك جاف. عندما تستيقظ في الصباح، شرب كوب من الماء الدافئ في الوقت المناسب يمكن أن يساعد في إزالة المتابين في الجسم، وتعزيز الأيض، وجعل الجسم يستعيد الحيوية بسرعة. هذا أيضًا يساعد في تنشيط حركة الأمعاء وتعزيز البراز، مما يعود بفائدة كبيرة للحفاظ على جهاز الهضم الصحي.\n\nثانياً، النهار هو وقت الذروة للأنشطة والعمل. يمكن لكمية مناسبة من الماء مساعدة في تنظيم درجة حرارة الجسم، وتجنب الجفاف، والحفاظ على وظيفة الجسم بشكل صحيح. شرب الماء مراحل بين العمل، والدراسة، أو ممارسة الرياضة لن يوفر فقط الترطيب اللازم، ولكن أيضًا يساعد في تخفيف التعب وتحسين التركيز والإنتاجية.\n\nأخيرًا، المساء هو أيضًا وقت للاهتمام بتناول الماء. شرب كوب من الماء قبل النوم يمكن أن يمنع العطش في الليل، مع مساعدة في تنظيف الكلى وتعزيز وظيفة التخلص من السموم في الجسم. ومع ذلك، من المهم تجنب شرب كمية كبيرة من الماء قرب وقت النوم لعدم التأثير على جودة النوم.\n\nشرب الماء مراحل لا يساعد فقط في تلبية احتياجات الماء للجسم في أوقات مختلفة، ولكنه أيضًا ينمي عادات شرب جيدة. شرب الماء بانتظام في فترة زمنية محددة، بحيث يتكيف الجسم تدريجياً لتشكيل نمط حياة منتظم. تطوير عادة علمية لشرب الماء ليس فقط مفيد للجسم ولكن أيضًا تجلي للمسؤولية تجاه النفس."),
        "tip_how": MessageLookupByLibrary.simpleMessage(
            "الحفاظ على توازن الماء والتركيز على احتياجات جسمك"),
        "tip_how_descrip": MessageLookupByLibrary.simpleMessage(
            "في الحياة اليومية، الحفاظ على توازن ماء جيد أمر أساسي للحفاظ على الصحة الجيدة. الماء هو مكون أساسي في جسم الإنسان ويلعب دورًا حيويًا في مختلف الوظائف الفيزيولوجية والعمليات الأيضية. لذلك، الانتباه إلى احتياجات الماء للجسم والحفاظ على توازن ماء سليم هو جزء من إدارة صحتنا اليومية التي لا يمكن تجاهلها.\n\nأولاً، الماء ضروري للوظائف الصحيحة للجسم. إنه مشارك في العديد من العمليات الفيزيولوجية مثل الدورة الدموية، والهضم والامتصاص، وتنظيم درجة الحرارة. يمكن للماء الكافي الحفاظ على تخفيف الدم، وتحسين تدفق الدم، وبالتالي المساعدة في توصيل المواد الغذائية إلى جميع أنحاء الجسم. بالإضافة إلى ذلك، الرطوبة تساعد أيضًا في الحفاظ على مرونة الجلد، وتعزيز الأيض، والحفاظ على الحالة البدنية الجيدة.\n\nثانياً، الانتباه إلى احتياجات الماء لجسمك يساعد في الحفاظ على توازن الكهرليتات الخاص بك. ففقدان الماء يترافق مع عدم توازن الكهرليتات، التي تعتبر أساسية لوظائف مثل نقل الأعصاب وانقباض العضلات. لذلك، يمكن لتناول الماء السليم مساعدتنا في تجنب اضطرابات الكهرليتات والحفاظ على العمل الطبيعي لمختلف الأنظمة في الجسم.\n\nبالإضافة إلى ذلك، ستختلف احتياجاتنا للماء مع مواسم مختلفة وشدة النشاط. من المرجح أن يفقد جسمك الماء في الطقس الحار أو أثناء ممارسة الرياضة المكثفة، لذا يجب عليك زيادة تناول الماء لتجنب الجفاف. التكيف المناسب لتناول الماء، مع التركيز على احتياجات الجسم الفعلية، هو السبيل للحفاظ على توازن الماء.\n\nفي النهاية، الحفاظ على توازن الماء هو أحد أسس الحفاظ على الصحة الجيدة. يجب علينا دائمًا الانتباه إلى احتياجات الماء للجسم لضمان تناول الماء السليم، لتعزيز الوظيفة الطبيعية للجسم والحفاظ على الصحة الجيدة. من خلال شرب الماء بشكل صحيح، يمكننا خلق حياة أكثر صحة وحيوية."),
        "tip_when": MessageLookupByLibrary.simpleMessage(
            "تفضيل المشروبات خالية من السكر والتقليل من المشروبات الغنية بالسكر"),
        "tip_when_descrip": MessageLookupByLibrary.simpleMessage(
            "اختيار شرب المشروبات خالية من السكر وتقليل تناول المشروبات الغنية بالسكر هو اختيار إيجابي وصحي لنمط حياة. هذه العادة الغذائية الصحية لا تساعد فقط في الحفاظ على الصحة العامة للجسم، ولكنها أيضًا تساعد في منع مجموعة من الأمراض المزمنة وتحسين جودة الحياة. أولاً، يعتبر التقليل من تناول المشروبات الغنية بالسكر أمرًا أساسيًا لإدارة الوزن. المشروبات الغنية بالسكر غالبًا ما تكون غنية بالسعرات الحرارية، وهذه السعرات الحرارية غالبًا ما تكون \'سعرات حرارية فارغة\'، والتي توفر سعرات حرارية ولكن لا تحتوي على قيمة غذائية تذكر. من خلال اختيار المشروبات خالية من السكر، يمكنك التحكم بشكل أفضل في تناول السعرات الحرارية والمساعدة في الحفاظ على وزن صحي. ثانيًا، يمكن أن يساعد تقليل تناول السكر في منع تطوير الأمراض المزمنة مثل السكري وأمراض القلب والأوعية الدموية. يرتبط استهلاك السكر الزائد بشكل قوي بخطر الإصابة بهذه الأمراض. من خلال اختيار المشروبات خالية من السكر، يمكنك خفض مستويات السكر في الدم، وتقليل العبء على الجوز والمساعدة في منع السكري وتقليل فرص الإصابة بأمراض القلب والأوعية الدموية. بالإضافة إلى ذلك، يمكن أن يساعد تقليل تناول المشروبات الغنية بالسكر في الحفاظ أيضًا على الصحة الفموية. يمكن أن تؤدي المشروبات الغنية بالسكر إلى تسوس الأسنان بسهولة والإصابة بأمراض اللثة. اختيار المشروبات خالية من السكر لا يؤثر فقط سلبًا على أسنانك، ولكنه أيضًا يساعد في الحفاظ على نظافة فمك. وأخيرًا، يصبح اختيار المشروبات خالية من السكر أكثر انتشارًا، بما في ذلك مجموعة متنوعة من نكهات الشاي خالية من السكر والقهوة خالية من السكر والمشروبات الغازية خالية من السكر وغيرها. يوفر هذا خيارًا صحيًا لأولئك الذين يفضلون مجموعة متنوعة من المشروبات. بشكل عام، يعتبر اختيار تفضيل المشروبات خالية من السكر وتقليل تناول المشروبات الغنية بالسكر تدبيرًا مهمًا للمسؤولية الصحية الفردية. من خلال غرس عادات تناول جيدة، يمكننا حماية أجسادنا بشكل أفضل والتحرك نحو نمط حياة صحي ونشط."),
        "water": MessageLookupByLibrary.simpleMessage("ماء"),
        "week": MessageLookupByLibrary.simpleMessage("أسبوع"),
        "week_desc": MessageLookupByLibrary.simpleMessage(
            "بعد الافتتاح، لن تتلقى أي رسائل على هذا."),
        "week_mode": MessageLookupByLibrary.simpleMessage("وضع نهاية الأسبوع"),
        "year": MessageLookupByLibrary.simpleMessage("سنة")
      };
}
